controllers/UserController.php

    protected function findModel($id)
    {
        if (($model = User::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `user` WHERE `id`='1'