components/AuthHandler.php

SELECT * FROM `user` WHERE `email`='aaseemshrivastava@gmail.com'
SELECT * FROM `auth` WHERE (`source`='google') AND (`source_id`='103248405342242566235')
---
    public function handle()
    {
        $attributes = $this->client->getUserAttributes();

        $email = $id = $fullname = $firstname = $lastname = "";
        $source = $this->client->getId();
        if($source == "google"){
            $email = $attributes['email'];
            $id = $attributes['id'];
            $fullname = $attributes['name'];
            $firstname = $attributes['given_name'];
            $lastname = $attributes['family_name'];
        }else if($source == "live"){
            $email = $attributes['emails']['account'];
            $id = $attributes['id'];
            $fullname = $attributes['name'];
            $firstname = $attributes['first_name'];
            $lastname = $attributes['last_name'];
        }else if($source == "facebook"){
            $email = $attributes['email'];
            $id = $attributes['id'];
            $fullname = $attributes['name'];
            $nameArr = explode(" ", $attributes['name']);
            $firstname = $nameArr[0];
            $lastname = $nameArr[1];
        }


        $user = User::find()->where(['email' => $email])->one();
        if($user){
            $auth = Auth::find()->where([
                'source' => $source,
                'source_id' => $id,
            ])->one();

UPDATE `user` SET `updated_at`='2022-07-27 20:27:40' WHERE `id`=2
---
                $user = $auth->user;
                Yii::$app->user->login($user);
            }else{
                $user->updated_at = date('Y-m-d H:i:s');

INSERT INTO `auth` (`user_id`, `source`, `source_id`) VALUES (2, 'google', '103248405342242566235')
---
                        'source' => $source,
                        'source_id' => (string)$id,
                    ]);
                    if ($auth->save()) {

INSERT INTO `user` (`first_name`, `last_name`, `email`, `password`, `auth_key`) VALUES ('Aseem', 'Shrivastava', 'aseem.shrivastava@mylofamily.com', 'b7f36b99b8fa57645ced433ad58b6bdc', 'KcUj6CVZD5LD')
---
            $user->password = md5($email);
            $user->auth_key = Yii::$app->security->generateRandomString(12);
            $transaction = User::getDb()->beginTransaction();
            if($user->save()){

INSERT INTO `auth` (`user_id`, `source`, `source_id`) VALUES (3, 'google', '117239866419073017295')
---
                    'source' => $source,
                    'source_id' => (string)$id,
                ]);
                if ($auth->save()) {